mikeakohn/naken_asm/include/pic18/p18f45k50.inc
FSR0                 equ      0x0
FSR1                 equ      0x1
FSR2                 equ      0x2
FAST                 equ      0x1
W                    equ      0x0
A                    equ      0x0
ACCESS               equ      0x0
BANKED               equ      0x1
SRCON1               equ   0x0f57
SRCON0               equ   0x0f58
CCPTMRS              equ   0x0f59
VREGCON              equ   0x0f5a
ANSELA               equ   0x0f5b
ANSELB               equ   0x0f5c
ANSELC               equ   0x0f5d
ANSELD               equ   0x0f5e
ANSELE               equ   0x0f5f
UCON                 equ   0x0f60
USTAT                equ   0x0f61
UCFG                 equ   0x0f62
UADDR                equ   0x0f63
UIE                  equ   0x0f64
UIR                  equ   0x0f65
UEIE                 equ   0x0f66
UEIR                 equ   0x0f67
UFRM                 equ   0x0f68
UFRML                equ   0x0f68
UFRMH                equ   0x0f69
UEP0                 equ   0x0f6a
UEP1                 equ   0x0f6b
UEP2                 equ   0x0f6c
UEP3                 equ   0x0f6d
UEP4                 equ   0x0f6e
UEP5                 equ   0x0f6f
UEP6                 equ   0x0f70
UEP7                 equ   0x0f71
UEP8                 equ   0x0f72
UEP9                 equ   0x0f73
UEP10                equ   0x0f74
UEP11                equ   0x0f75
UEP12                equ   0x0f76
UEP13                equ   0x0f77
UEP14                equ   0x0f78
UEP15                equ   0x0f79
SLRCON               equ   0x0f7a
VREFCON2             equ   0x0f7b
VREFCON1             equ   0x0f7c
VREFCON0             equ   0x0f7d
PMD0                 equ   0x0f7e
PMD1                 equ   0x0f7f
PORTA                equ   0x0f80
PORTB                equ   0x0f81
PORTC                equ   0x0f82
PORTD                equ   0x0f83
PORTE                equ   0x0f84
WPUB                 equ   0x0f85
IOCB                 equ   0x0f86
IOCC                 equ   0x0f87
CTMUICON             equ   0x0f88
LATA                 equ   0x0f89
LATB                 equ   0x0f8a
LATC                 equ   0x0f8b
LATD                 equ   0x0f8c
LATE                 equ   0x0f8d
CTMUCON1             equ   0x0f8e
CTMUCONL             equ   0x0f8e
CTMUCON0             equ   0x0f8f
CTMUCONH             equ   0x0f8f
CCPR2                equ   0x0f90
CCPR2L               equ   0x0f90
CCPR2H               equ   0x0f91
DDRA                 equ   0x0f92
TRISA                equ   0x0f92
DDRB                 equ   0x0f93
TRISB                equ   0x0f93
DDRC                 equ   0x0f94
TRISC                equ   0x0f94
DDRD                 equ   0x0f95
TRISD                equ   0x0f95
DDRE                 equ   0x0f96
TRISE                equ   0x0f96
CCP2CON              equ   0x0f97
ECCP2CON             equ   0x0f97
CM1CON0              equ   0x0f98
CM2CON0              equ   0x0f99
CM2CON1              equ   0x0f9a
OSCTUNE              equ   0x0f9b
HLVDCON              equ   0x0f9c
PIE1                 equ   0x0f9d
PIR1                 equ   0x0f9e
IPR1                 equ   0x0f9f
PIE2                 equ   0x0fa0
PIR2                 equ   0x0fa1
IPR2                 equ   0x0fa2
PIE3                 equ   0x0fa3
PIR3                 equ   0x0fa4
IPR3                 equ   0x0fa5
EECON1               equ   0x0fa6
EECON2               equ   0x0fa7
EEDATA               equ   0x0fa8
EEADR                equ   0x0fa9
RCSTA                equ   0x0fab
RCSTA1               equ   0x0fab
TXSTA                equ   0x0fac
TXSTA1               equ   0x0fac
TXREG                equ   0x0fad
TXREG1               equ   0x0fad
RCREG                equ   0x0fae
RCREG1               equ   0x0fae
SPBRG                equ   0x0faf
SPBRG1               equ   0x0faf
SPBRGH               equ   0x0fb0
SPBRGH1              equ   0x0fb0
T3CON                equ   0x0fb1
TMR3                 equ   0x0fb2
TMR3L                equ   0x0fb2
TMR3H                equ   0x0fb3
T3GCON               equ   0x0fb4
ACTCON               equ   0x0fb5
STCON                equ   0x0fb5
ECCP1AS              equ   0x0fb6
ECCP1DEL             equ   0x0fb7
PWM1CON              equ   0x0fb7
BAUDCON              equ   0x0fb8
BAUDCON1             equ   0x0fb8
PSTR1CON             equ   0x0fb9
T2CON                equ   0x0fba
PR2                  equ   0x0fbb
TMR2                 equ   0x0fbc
CCP1CON              equ   0x0fbd
ECCP1CON             equ   0x0fbd
CCPR1                equ   0x0fbe
CCPR1L               equ   0x0fbe
CCPR1H               equ   0x0fbf
ADCON2               equ   0x0fc0
ADCON1               equ   0x0fc1
ADCON0               equ   0x0fc2
ADRESL               equ   0x0fc3
ADRESH               equ   0x0fc4
SSP1CON2             equ   0x0fc5
SSPCON2              equ   0x0fc5
SSP1CON1             equ   0x0fc6
SSPCON               equ   0x0fc6
SSPCON1              equ   0x0fc6
SSP1STAT             equ   0x0fc7
SSPSTAT              equ   0x0fc7
SSP1ADD              equ   0x0fc8
SSPADD               equ   0x0fc8
SSP1BUF              equ   0x0fc9
SSPBUF               equ   0x0fc9
SSP1MSK              equ   0x0fca
SSPMSK               equ   0x0fca
SSP1CON3             equ   0x0fcb
SSPCON3              equ   0x0fcb
T1GCON               equ   0x0fcc
T1CON                equ   0x0fcd
TMR1                 equ   0x0fce
TMR1L                equ   0x0fce
TMR1H                equ   0x0fcf
RCON                 equ   0x0fd0
WDTCON               equ   0x0fd1
OSCCON2              equ   0x0fd2
OSCCON               equ   0x0fd3
T0CON                equ   0x0fd5
TMR0                 equ   0x0fd6
TMR0L                equ   0x0fd6
TMR0H                equ   0x0fd7
STATUS               equ   0x0fd8
FSR2L                equ   0x0fd9
FSR2H                equ   0x0fda
PLUSW2               equ   0x0fdb
PREINC2              equ   0x0fdc
POSTDEC2             equ   0x0fdd
POSTINC2             equ   0x0fde
INDF2                equ   0x0fdf
BSR                  equ   0x0fe0
FSR1L                equ   0x0fe1
FSR1H                equ   0x0fe2
PLUSW1               equ   0x0fe3
PREINC1              equ   0x0fe4
POSTDEC1             equ   0x0fe5
POSTINC1             equ   0x0fe6
INDF1                equ   0x0fe7
WREG                 equ   0x0fe8
FSR0L                equ   0x0fe9
FSR0H                equ   0x0fea
PLUSW0               equ   0x0feb
PREINC0              equ   0x0fec
POSTDEC0             equ   0x0fed
POSTINC0             equ   0x0fee
INDF0                equ   0x0fef
INTCON3              equ   0x0ff0
INTCON2              equ   0x0ff1
INTCON               equ   0x0ff2
PROD                 equ   0x0ff3
PRODL                equ   0x0ff3
PRODH                equ   0x0ff4
TABLAT               equ   0x0ff5
TBLPTR               equ   0x0ff6
TBLPTRL              equ   0x0ff6
TBLPTRH              equ   0x0ff7
TBLPTRU              equ   0x0ff8
PC                   equ   0x0ff9
PCL                  equ   0x0ff9
PCLATH               equ   0x0ffa
PCLATU               equ   0x0ffb
STKPTR               equ   0x0ffc
TOS                  equ   0x0ffd
TOSL                 equ   0x0ffd
TOSH                 equ   0x0ffe
TOSU                 equ   0x0fff
SRRC1E               equ   0x0000
SRRC2E               equ   0x0001
SRRCKE               equ   0x0002
SRRPE                equ   0x0003
SRSC1E               equ   0x0004
SRSC2E               equ   0x0005
SRSCKE               equ   0x0006
SRSPE                equ   0x0007
SRPR                 equ   0x0000
SRPS                 equ   0x0001
SRNQEN               equ   0x0002
SRQEN                equ   0x0003
SRLEN                equ   0x0007
SRCLK0               equ   0x0004
SRCLK1               equ   0x0005
SRCLK2               equ   0x0006
C1TSEL               equ   0x0000
C2TSEL               equ   0x0003
ANSA0                equ   0x0000
ANSA1                equ   0x0001
ANSA2                equ   0x0002
ANSA3                equ   0x0003
ANSA5                equ   0x0005
ANSB0                equ   0x0000
ANSB1                equ   0x0001
ANSB2                equ   0x0002
ANSB3                equ   0x0003
ANSB4                equ   0x0004
ANSB5                equ   0x0005
ANSC2                equ   0x0002
ANSC6                equ   0x0006
ANSC7                equ   0x0007
ANSD0                equ   0x0000
ANSD1                equ   0x0001
ANSD2                equ   0x0002
ANSD3                equ   0x0003
ANSD4                equ   0x0004
ANSD5                equ   0x0005
ANSD6                equ   0x0006
ANSD7                equ   0x0007
ANSE0                equ   0x0000
ANSE1                equ   0x0001
ANSE2                equ   0x0002
SUSPND               equ   0x0001
RESUME               equ   0x0002
USBEN                equ   0x0003
PKTDIS               equ   0x0004
SE0                  equ   0x0005
PPBRST               equ   0x0006
PPBI                 equ   0x0001
DIR                  equ   0x0002
ENDP0                equ   0x0003
ENDP1                equ   0x0004
ENDP2                equ   0x0005
ENDP3                equ   0x0006
FSEN                 equ   0x0002
UTRDIS               equ   0x0003
UPUEN                equ   0x0004
UOEMON               equ   0x0006
UTEYE                equ   0x0007
PPB0                 equ   0x0000
PPB1                 equ   0x0001
ADDR0                equ   0x0000
ADDR1                equ   0x0001
ADDR2                equ   0x0002
ADDR3                equ   0x0003
ADDR4                equ   0x0004
ADDR5                equ   0x0005
ADDR6                equ   0x0006
URSTIE               equ   0x0000
UERRIE               equ   0x0001
ACTVIE               equ   0x0002
TRNIE                equ   0x0003
IDLEIE               equ   0x0004
STALLIE              equ   0x0005
SOFIE                equ   0x0006
URSTIF               equ   0x0000
UERRIF               equ   0x0001
ACTVIF               equ   0x0002
TRNIF                equ   0x0003
IDLEIF               equ   0x0004
STALLIF              equ   0x0005
SOFIF                equ   0x0006
PIDEE                equ   0x0000
CRC5EE               equ   0x0001
CRC16EE              equ   0x0002
DFN8EE               equ   0x0003
BTOEE                equ   0x0004
BTSEE                equ   0x0007
PIDEF                equ   0x0000
CRC5EF               equ   0x0001
CRC16EF              equ   0x0002
DFN8EF               equ   0x0003
BTOEF                equ   0x0004
BTSEF                equ   0x0007
FRM0                 equ   0x0000
FRM1                 equ   0x0001
FRM2                 equ   0x0002
FRM3                 equ   0x0003
FRM4                 equ   0x0004
FRM5                 equ   0x0005
FRM6                 equ   0x0006
FRM7                 equ   0x0007
FRM8                 equ   0x0000
FRM9                 equ   0x0001
FRM10                equ   0x0002
EPSTALL              equ   0x0000
EPINEN               equ   0x0001
EPOUTEN              equ   0x0002
EPCONDIS             equ   0x0003
EPHSHK               equ   0x0004
SLRA                 equ   0x0000
SLRB                 equ   0x0001
SLRC                 equ   0x0002
SLRD                 equ   0x0003
SLRE                 equ   0x0004
DACR0                equ   0x0000
DACR1                equ   0x0001
DACR2                equ   0x0002
DACR3                equ   0x0003
DACR4                equ   0x0004
DACNSS               equ   0x0000
DACOE                equ   0x0005
DACLPS               equ   0x0006
DACEN                equ   0x0007
DACPSS0              equ   0x0002
DACPSS1              equ   0x0003
TSRNG                equ   0x0002
TSEN                 equ   0x0003
FVRST                equ   0x0006
FVREN                equ   0x0007
FVRS0                equ   0x0004
FVRS1                equ   0x0005
TMR1MD               equ   0x0000
TMR2MD               equ   0x0001
TMR3MD               equ   0x0002
ACTMD                equ   0x0004
USBMD                equ   0x0005
UARTMD               equ   0x0006
STMD                 equ   0x0004
UART1MD              equ   0x0006
CCP1MD               equ   0x0000
CCP2MD               equ   0x0001
ADCMD                equ   0x0002
CMP1MD               equ   0x0003
CMP2MD               equ   0x0004
CTMUMD               equ   0x0005
MSSPMD               equ   0x0006
SSP1MD               equ   0x0006
MSSP1MD              equ   0x0006
RA0                  equ   0x0000
RA1                  equ   0x0001
RA2                  equ   0x0002
RA3                  equ   0x0003
RA4                  equ   0x0004
RA5                  equ   0x0005
RA6                  equ   0x0006
RA7                  equ   0x0007
AN0                  equ   0x0000
AN1                  equ   0x0001
AN2                  equ   0x0002
AN3                  equ   0x0003
T0CKI                equ   0x0004
AN4                  equ   0x0005
OSC2                 equ   0x0006
VREFM                equ   0x0002
VREFP                equ   0x0003
LVDIN                equ   0x0005
HLVDIN               equ   0x0005
RB0                  equ   0x0000
RB1                  equ   0x0001
RB2                  equ   0x0002
RB3                  equ   0x0003
RB4                  equ   0x0004
RB5                  equ   0x0005
RB6                  equ   0x0006
RB7                  equ   0x0007
INT0                 equ   0x0000
INT1                 equ   0x0001
INT2                 equ   0x0002
PGM                  equ   0x0005
PGC                  equ   0x0006
PGD                  equ   0x0007
RC0                  equ   0x0000
RC1                  equ   0x0001
RC2                  equ   0x0002
RC4                  equ   0x0004
RC5                  equ   0x0005
RC6                  equ   0x0006
RC7                  equ   0x0007
T1OSO                equ   0x0000
T1OSI                equ   0x0001
CCP1                 equ   0x0002
TX                   equ   0x0006
RX                   equ   0x0007
T13CKI               equ   0x0000
P1A                  equ   0x0002
CK                   equ   0x0006
RD0                  equ   0x0000
RD1                  equ   0x0001
RD2                  equ   0x0002
RD3                  equ   0x0003
RD4                  equ   0x0004
RD5                  equ   0x0005
RD6                  equ   0x0006
RD7                  equ   0x0007
SPP0                 equ   0x0000
SPP1                 equ   0x0001
SPP2                 equ   0x0002
SPP3                 equ   0x0003
SPP4                 equ   0x0004
SPP5                 equ   0x0005
SPP6                 equ   0x0006
SPP7                 equ   0x0007
RE0                  equ   0x0000
RE1                  equ   0x0001
RE2                  equ   0x0002
RE3                  equ   0x0003
CK1SPP               equ   0x0000
CK2SPP               equ   0x0001
OESPP                equ   0x0002
WPUB0                equ   0x0000
WPUB1                equ   0x0001
WPUB2                equ   0x0002
WPUB3                equ   0x0003
WPUB4                equ   0x0004
WPUB5                equ   0x0005
WPUB6                equ   0x0006
WPUB7                equ   0x0007
IOCB4                equ   0x0004
IOCB5                equ   0x0005
IOCB6                equ   0x0006
IOCB7                equ   0x0007
IOCC0                equ   0x0000
IOCC1                equ   0x0001
IOCC2                equ   0x0002
IOCC4                equ   0x0004
IOCC5                equ   0x0005
IOCC6                equ   0x0006
IOCC7                equ   0x0007
IRNG0                equ   0x0000
IRNG1                equ   0x0001
ITRIM0               equ   0x0002
ITRIM1               equ   0x0003
ITRIM2               equ   0x0004
ITRIM3               equ   0x0005
ITRIM4               equ   0x0006
ITRIM5               equ   0x0007
LATA0                equ   0x0000
LATA1                equ   0x0001
LATA2                equ   0x0002
LATA3                equ   0x0003
LATA4                equ   0x0004
LATA5                equ   0x0005
LATA6                equ   0x0006
LATA7                equ   0x0007
LATB0                equ   0x0000
LATB1                equ   0x0001
LATB2                equ   0x0002
LATB3                equ   0x0003
LATB4                equ   0x0004
LATB5                equ   0x0005
LATB6                equ   0x0006
LATB7                equ   0x0007
LATC0                equ   0x0000
LATC1                equ   0x0001
LATC2                equ   0x0002
LATC4                equ   0x0004
LATC5                equ   0x0005
LATC6                equ   0x0006
LATC7                equ   0x0007
LATD0                equ   0x0000
LATD1                equ   0x0001
LATD2                equ   0x0002
LATD3                equ   0x0003
LATD4                equ   0x0004
LATD5                equ   0x0005
LATD6                equ   0x0006
LATD7                equ   0x0007
LATE0                equ   0x0000
LATE1                equ   0x0001
LATE2                equ   0x0002
EDG1STAT             equ   0x0000
EDG2STAT             equ   0x0001
EDG1POL              equ   0x0004
EDG2POL              equ   0x0007
EDG1SEL0             equ   0x0002
EDG1SEL1             equ   0x0003
EDG2SEL0             equ   0x0005
EDG2SEL1             equ   0x0006
CTTRIG               equ   0x0000
IDISSEN              equ   0x0001
EDGSEQEN             equ   0x0002
EDGEN                equ   0x0003
TGEN                 equ   0x0004
CTMUSIDL             equ   0x0005
CTMUEN               equ   0x0007
TRIGEN               equ   0x0000
SIDL                 equ   0x0005
ON                   equ   0x0007
TRISA0               equ   0x0000
TRISA1               equ   0x0001
TRISA2               equ   0x0002
TRISA3               equ   0x0003
TRISA4               equ   0x0004
TRISA5               equ   0x0005
TRISA6               equ   0x0006
TRISA7               equ   0x0007
TRISB0               equ   0x0000
TRISB1               equ   0x0001
TRISB2               equ   0x0002
TRISB3               equ   0x0003
TRISB4               equ   0x0004
TRISB5               equ   0x0005
TRISB6               equ   0x0006
TRISB7               equ   0x0007
TRISC0               equ   0x0000
TRISC1               equ   0x0001
TRISC2               equ   0x0002
TRISC4               equ   0x0004
TRISC5               equ   0x0005
TRISC6               equ   0x0006
TRISC7               equ   0x0007
TRISD0               equ   0x0000
TRISD1               equ   0x0001
TRISD2               equ   0x0002
TRISD3               equ   0x0003
TRISD4               equ   0x0004
TRISD5               equ   0x0005
TRISD6               equ   0x0006
TRISD7               equ   0x0007
TRISE0               equ   0x0000
TRISE1               equ   0x0001
TRISE2               equ   0x0002
WPUE3                equ   0x0007
CCP2M0               equ   0x0000
CCP2M1               equ   0x0001
CCP2M2               equ   0x0002
CCP2M3               equ   0x0003
DC2B0                equ   0x0004
DC2B1                equ   0x0005
CCP2Y                equ   0x0004
CCP2X                equ   0x0005
C1R                  equ   0x0002
C1SP                 equ   0x0003
C1POL                equ   0x0004
C1OE                 equ   0x0005
C1OUT                equ   0x0006
C1ON                 equ   0x0007
C1CH0                equ   0x0000
C1CH1                equ   0x0001
CREF                 equ   0x0002
CPOL                 equ   0x0004
COE                  equ   0x0005
COUT1                equ   0x0006
CON                  equ   0x0007
CCH0                 equ   0x0000
CCH1                 equ   0x0001
C2R                  equ   0x0002
C2SP                 equ   0x0003
C2POL                equ   0x0004
C2OE                 equ   0x0005
C2OUT                equ   0x0006
C2ON                 equ   0x0007
C2CH0                equ   0x0000
C2CH1                equ   0x0001
COUT2                equ   0x0006
C2SYNC               equ   0x0000
C1SYNC               equ   0x0001
C2HYS                equ   0x0002
C1HYS                equ   0x0003
C2RSEL               equ   0x0004
C1RSEL               equ   0x0005
MC2OUT               equ   0x0006
MC1OUT               equ   0x0007
SPLLMULT             equ   0x0007
TUN0                 equ   0x0000
TUN1                 equ   0x0001
TUN2                 equ   0x0002
TUN3                 equ   0x0003
TUN4                 equ   0x0004
TUN5                 equ   0x0005
TUN6                 equ   0x0006
HLVDEN               equ   0x0004
IRVST                equ   0x0005
BGVST                equ   0x0006
VDIRMAG              equ   0x0007
HLVDL0               equ   0x0000
HLVDL1               equ   0x0001
HLVDL2               equ   0x0002
HLVDL3               equ   0x0003
TMR1IE               equ   0x0000
TMR2IE               equ   0x0001
CCP1IE               equ   0x0002
SSPIE                equ   0x0003
TXIE                 equ   0x0004
RCIE                 equ   0x0005
ADIE                 equ   0x0006
ACTIE                equ   0x0007
SSP1IE               equ   0x0003
TX1IE                equ   0x0004
RC1IE                equ   0x0005
STIE                 equ   0x0007
TMR1IF               equ   0x0000
TMR2IF               equ   0x0001
CCP1IF               equ   0x0002
SSPIF                equ   0x0003
TXIF                 equ   0x0004
RCIF                 equ   0x0005
ADIF                 equ   0x0006
ACTIF                equ   0x0007
SSP1IF               equ   0x0003
TX1IF                equ   0x0004
RC1IF                equ   0x0005
STIF                 equ   0x0007
TMR1IP               equ   0x0000
TMR2IP               equ   0x0001
CCP1IP               equ   0x0002
SSPIP                equ   0x0003
TXIP                 equ   0x0004
RCIP                 equ   0x0005
ADIP                 equ   0x0006
ACTIP                equ   0x0007
SSP1IP               equ   0x0003
TX1IP                equ   0x0004
RC1IP                equ   0x0005
STIP                 equ   0x0007
CCP2IE               equ   0x0000
TMR3IE               equ   0x0001
HLVDIE               equ   0x0002
BCLIE                equ   0x0003
EEIE                 equ   0x0004
C2IE                 equ   0x0005
C1IE                 equ   0x0006
OSCFIE               equ   0x0007
LVDIE                equ   0x0002
BCL1IE               equ   0x0003
CM2IE                equ   0x0005
CM1IE                equ   0x0006
CCP2IF               equ   0x0000
TMR3IF               equ   0x0001
HLVDIF               equ   0x0002
BCLIF                equ   0x0003
EEIF                 equ   0x0004
C2IF                 equ   0x0005
C1IF                 equ   0x0006
OSCFIF               equ   0x0007
LVDIF                equ   0x0002
BCL1IF               equ   0x0003
CM2IF                equ   0x0005
CM1IF                equ   0x0006
CCP2IP               equ   0x0000
TMR3IP               equ   0x0001
HLVDIP               equ   0x0002
BCLIP                equ   0x0003
EEIP                 equ   0x0004
C2IP                 equ   0x0005
C1IP                 equ   0x0006
OSCFIP               equ   0x0007
LVDIP                equ   0x0002
BCL1IP               equ   0x0003
CM2IP                equ   0x0005
CM1IP                equ   0x0006
TMR1GIE              equ   0x0000
TMR3GIE              equ   0x0001
USBIE                equ   0x0002
CTMUIE               equ   0x0003
TMR1GIF              equ   0x0000
TMR3GIF              equ   0x0001
USBIF                equ   0x0002
CTMUIF               equ   0x0003
TMR1GIP              equ   0x0000
TMR3GIP              equ   0x0001
USBIP                equ   0x0002
CTMUIP               equ   0x0003
RD                   equ   0x0000
WR                   equ   0x0001
WREN                 equ   0x0002
WRERR                equ   0x0003
FREE                 equ   0x0004
CFGS                 equ   0x0006
EEPGD                equ   0x0007
RX9D                 equ   0x0000
OERR                 equ   0x0001
FERR                 equ   0x0002
ADDEN                equ   0x0003
CREN                 equ   0x0004
SREN                 equ   0x0005
RX9                  equ   0x0006
SPEN                 equ   0x0007
ADEN                 equ   0x0003
TX9D                 equ   0x0000
TRMT                 equ   0x0001
BRGH                 equ   0x0002
