mikeakohn/naken_asm/include/pic18/p18f45k50.inc
SENDB                equ   0x0003
SYNC                 equ   0x0004
TXEN                 equ   0x0005
TX9                  equ   0x0006
CSRC                 equ   0x0007
BRG0                 equ   0x0000
BRG1                 equ   0x0001
BRG2                 equ   0x0002
BRG3                 equ   0x0003
BRG4                 equ   0x0004
BRG5                 equ   0x0005
BRG6                 equ   0x0006
BRG7                 equ   0x0007
BRG8                 equ   0x0000
BRG9                 equ   0x0001
BRG10                equ   0x0002
BRG11                equ   0x0003
BRG12                equ   0x0004
BRG13                equ   0x0005
BRG14                equ   0x0006
BRG15                equ   0x0007
TMR3ON               equ   0x0000
RD16                 equ   0x0001
NOT_T3SYNC           equ   0x0002
SOSCEN               equ   0x0003
T3RD16               equ   0x0001
T3SYNC               equ   0x0002
T3SOSCEN             equ   0x0003
T3CKPS0              equ   0x0004
T3CKPS1              equ   0x0005
TMR3CS0              equ   0x0006
TMR3CS1              equ   0x0007
T3OSCEN              equ   0x0003
T3GVAL               equ   0x0002
T3GGO_NOT_T3DONE     equ   0x0003
T3GSPM               equ   0x0004
T3GTM                equ   0x0005
T3GPOL               equ   0x0006
TMR3GE               equ   0x0007
T3GSS0               equ   0x0000
T3GSS1               equ   0x0001
T3GGO                equ   0x0003
NOT_T3DONE           equ   0x0003
T3DONE               equ   0x0003
T3GGO_NOT_DONE       equ   0x0003
ACTORS               equ   0x0001
ACTLOCK              equ   0x0003
ACTSRC               equ   0x0004
ACTUD                equ   0x0006
ACTEN                equ   0x0007
STOR                 equ   0x0001
STLOCK               equ   0x0003
STSRC                equ   0x0004
STUD                 equ   0x0006
STEN                 equ   0x0007
ACTOR                equ   0x0001
ACTD                 equ   0x0006
ACTSEL               equ   0x0007
ECCP1ASE             equ   0x0007
PSS1BD0              equ   0x0000
PSS1BD1              equ   0x0001
PSS1AC0              equ   0x0002
PSS1AC1              equ   0x0003
ECCP1AS0             equ   0x0004
ECCP1AS1             equ   0x0005
ECCP1AS2             equ   0x0006
CCP1ASE              equ   0x0007
PSSBD0               equ   0x0000
PSSBD1               equ   0x0001
PSSAC0               equ   0x0002
PSSAC1               equ   0x0003
P1RSEN               equ   0x0007
PDC0                 equ   0x0000
PDC1                 equ   0x0001
PDC2                 equ   0x0002
PDC3                 equ   0x0003
PDC4                 equ   0x0004
PDC5                 equ   0x0005
PDC6                 equ   0x0006
PR1SEN               equ   0x0007
ABDEN                equ   0x0000
WUE                  equ   0x0001
BRG16                equ   0x0003
TXCKP                equ   0x0004
RXDTP                equ   0x0005
RCIDL                equ   0x0006
ABDOVF               equ   0x0007
CKTXP                equ   0x0004
DTRXP                equ   0x0005
SCKP                 equ   0x0004
RCMT                 equ   0x0006
STRA                 equ   0x0000
STRB                 equ   0x0001
STRC                 equ   0x0002
STRD                 equ   0x0003
STRSYNC              equ   0x0004
STR1A                equ   0x0000
STR1B                equ   0x0001
STR1C                equ   0x0002
STR1D                equ   0x0003
STR1SYNC             equ   0x0004
TMR2ON               equ   0x0002
T2CKPS0              equ   0x0000
T2CKPS1              equ   0x0001
T2OUTPS0             equ   0x0003
T2OUTPS1             equ   0x0004
T2OUTPS2             equ   0x0005
T2OUTPS3             equ   0x0006
CCP1M0               equ   0x0000
CCP1M1               equ   0x0001
CCP1M2               equ   0x0002
CCP1M3               equ   0x0003
DC1B0                equ   0x0004
DC1B1                equ   0x0005
P1M0                 equ   0x0006
P1M1                 equ   0x0007
CCP1Y                equ   0x0004
CCP1X                equ   0x0005
ADFM                 equ   0x0007
ADCS0                equ   0x0000
ADCS1                equ   0x0001
ADCS2                equ   0x0002
ACQT0                equ   0x0003
ACQT1                equ   0x0004
ACQT2                equ   0x0005
TRIGSEL              equ   0x0007
NVCFG0               equ   0x0000
NVCFG1               equ   0x0001
PVCFG0               equ   0x0002
PVCFG1               equ   0x0003
ADON                 equ   0x0000
GO_NOT_DONE          equ   0x0001
DONE                 equ   0x0001
GO                   equ   0x0001
NOT_DONE             equ   0x0001
SEN                  equ   0x0000
RSEN                 equ   0x0001
PEN                  equ   0x0002
RCEN                 equ   0x0003
ACKEN                equ   0x0004
ACKDT                equ   0x0005
ACKSTAT              equ   0x0006
GCEN                 equ   0x0007
CKP                  equ   0x0004
SSPEN                equ   0x0005
SSPOV                equ   0x0006
WCOL                 equ   0x0007
SSPM0                equ   0x0000
SSPM1                equ   0x0001
SSPM2                equ   0x0002
SSPM3                equ   0x0003
BF                   equ   0x0000
UA                   equ   0x0001
R_NOT_W              equ   0x0002
S                    equ   0x0003
P                    equ   0x0004
D_NOT_A              equ   0x0005
CKE                  equ   0x0006
SMP                  equ   0x0007
SSP1ADD0             equ   0x0000
SSP1ADD1             equ   0x0001
SSP1ADD2             equ   0x0002
SSP1ADD3             equ   0x0003
SSP1ADD4             equ   0x0004
SSP1ADD5             equ   0x0005
SSP1ADD6             equ   0x0006
SSP1ADD7             equ   0x0007
SSP1MSK0             equ   0x0000
SSP1MSK1             equ   0x0001
SSP1MSK2             equ   0x0002
SSP1MSK3             equ   0x0003
SSP1MSK4             equ   0x0004
SSP1MSK5             equ   0x0005
SSP1MSK6             equ   0x0006
SSP1MSK7             equ   0x0007
DHEN                 equ   0x0000
AHEN                 equ   0x0001
SBCDE                equ   0x0002
SDAHT                equ   0x0003
BOEN                 equ   0x0004
SCIE                 equ   0x0005
PCIE                 equ   0x0006
ACKTIM               equ   0x0007
T1GVAL               equ   0x0002
T1GGO_NOT_T1DONE     equ   0x0003
T1GSPM               equ   0x0004
T1GTM                equ   0x0005
T1GPOL               equ   0x0006
TMR1GE               equ   0x0007
T1GSS0               equ   0x0000
T1GSS1               equ   0x0001
T1GGO                equ   0x0003
NOT_T1DONE           equ   0x0003
T1DONE               equ   0x0003
T1GGO_NOT_DONE       equ   0x0003
TMR1ON               equ   0x0000
NOT_T1SYNC           equ   0x0002
T1RD16               equ   0x0001
T1SYNC               equ   0x0002
T1SOSCEN             equ   0x0003
T1CKPS0              equ   0x0004
T1CKPS1              equ   0x0005
TMR1CS0              equ   0x0006
TMR1CS1              equ   0x0007
T1OSCEN              equ   0x0003
NOT_BOR              equ   0x0000
NOT_POR              equ   0x0001
NOT_PD               equ   0x0002
NOT_TO               equ   0x0003
NOT_RI               equ   0x0004
SBOREN               equ   0x0006
IPEN                 equ   0x0007
BOR                  equ   0x0000
POR                  equ   0x0001
PD                   equ   0x0002
TO                   equ   0x0003
RI                   equ   0x0004
SWDTEN               equ   0x0000
SWDTE                equ   0x0000
LFIOFS               equ   0x0000
HFIOFR               equ   0x0001
PRISD                equ   0x0002
SOSCGO               equ   0x0003
PLLEN                equ   0x0004
INTSRC               equ   0x0005
SOSCRUN              equ   0x0006
PLLRDY               equ   0x0007
HFIOFS               equ   0x0002
OSTS                 equ   0x0003
IDLEN                equ   0x0007
SCS0                 equ   0x0000
SCS1                 equ   0x0001
FLTS                 equ   0x0002
IRCF0                equ   0x0004
IRCF1                equ   0x0005
IRCF2                equ   0x0006
PSA                  equ   0x0003
T0SE                 equ   0x0004
T0CS                 equ   0x0005
T08BIT               equ   0x0006
TMR0ON               equ   0x0007
T0PS0                equ   0x0000
T0PS1                equ   0x0001
T0PS2                equ   0x0002
C                    equ   0x0000
DC                   equ   0x0001
Z                    equ   0x0002
OV                   equ   0x0003
N                    equ   0x0004
INT1IF               equ   0x0000
INT2IF               equ   0x0001
INT1IE               equ   0x0003
INT2IE               equ   0x0004
INT1IP               equ   0x0006
INT2IP               equ   0x0007
INT1F                equ   0x0000
INT2F                equ   0x0001
INT1E                equ   0x0003
INT2E                equ   0x0004
INT1P                equ   0x0006
INT2P                equ   0x0007
IOCIP                equ   0x0000
TMR0IP               equ   0x0002
INTEDG2              equ   0x0004
INTEDG1              equ   0x0005
INTEDG0              equ   0x0006
NOT_RBPU             equ   0x0007
T0IP                 equ   0x0002
RBPU                 equ   0x0007
IOCIF                equ   0x0000
INT0IF               equ   0x0001
TMR0IF               equ   0x0002
IOCIE                equ   0x0003
INT0IE               equ   0x0004
TMR0IE               equ   0x0005
PEIE_GIEL            equ   0x0006
GIE_GIEH             equ   0x0007
INT0F                equ   0x0001
T0IF                 equ   0x0002
INT0E                equ   0x0004
T0IE                 equ   0x0005
PEIE                 equ   0x0006
GIE                  equ   0x0007
GIEL                 equ   0x0006
GIEH                 equ   0x0007
STKUNF               equ   0x0006
STKFUL               equ   0x0007
SP0                  equ   0x0000
SP1                  equ   0x0001
SP2                  equ   0x0002
SP3                  equ   0x0003
SP4                  equ   0x0004
STKOVF               equ   0x0007
_CONFIG1L            equ 0x300000
_CONFIG1H            equ 0x300001
_CONFIG2L            equ 0x300002
_CONFIG2H            equ 0x300003
_CONFIG3H            equ 0x300005
_CONFIG4L            equ 0x300006
_CONFIG5L            equ 0x300008
_CONFIG5H            equ 0x300009
_CONFIG6L            equ 0x30000a
_CONFIG6H            equ 0x30000b
_CONFIG7L            equ 0x30000c
_CONFIG7H            equ 0x30000d
_PLLSEL_PLL4X_1L     equ     0xfe
_PLLSEL_PLL3X_1L     equ     0xff
_CFGPLLEN_OFF_1L     equ     0xfd
_CFGPLLEN_ON_1L      equ     0xff
_CPUDIV_NOCLKDIV_1L  equ     0xe7
_CPUDIV_CLKDIV2_1L   equ     0xef
_CPUDIV_CLKDIV3_1L   equ     0xf7
_CPUDIV_CLKDIV6_1L   equ     0xff
_LS48MHZ_SYS24X4_1L  equ     0xdf
_LS48MHZ_SYS48X8_1L  equ     0xff
_FOSC_LP_1H          equ     0xf0
_FOSC_XT_1H          equ     0xf1
_FOSC_HSH_1H         equ     0xf2
_FOSC_HSM_1H         equ     0xf3
_FOSC_ECHCLKO_1H     equ     0xf4
_FOSC_ECHIO_1H       equ     0xf5
_FOSC_RCCLKO_1H      equ     0xf6
_FOSC_RCIO_1H        equ     0xf7
_FOSC_INTOSCIO_1H    equ     0xf8
_FOSC_INTOSCCLKO_1H  equ     0xf9
_FOSC_ECMCLKO_1H     equ     0xfa
_FOSC_ECMIO_1H       equ     0xfb
_FOSC_ECLCLKO_1H     equ     0xfc
_FOSC_ECLIO_1H       equ     0xfd
_PCLKEN_OFF_1H       equ     0xdf
_PCLKEN_ON_1H        equ     0xff
_FCMEN_OFF_1H        equ     0xbf
_FCMEN_ON_1H         equ     0xff
_IESO_OFF_1H         equ     0x7f
_IESO_ON_1H          equ     0xff
_nPWRTEN_ON_2L       equ     0xfe
_nPWRTEN_OFF_2L      equ     0xff
_BOREN_OFF_2L        equ     0xf9
_BOREN_ON_2L         equ     0xfb
_BOREN_NOSLP_2L      equ     0xfd
_BOREN_SBORDIS_2L    equ     0xff
_BORV_285_2L         equ     0xe7
_BORV_250_2L         equ     0xef
_BORV_220_2L         equ     0xf7
_BORV_190_2L         equ     0xff
_nLPBOR_ON_2L        equ     0xbf
_nLPBOR_OFF_2L       equ     0xff
_WDTEN_OFF_2H        equ     0xfc
_WDTEN_NOSLP_2H      equ     0xfd
_WDTEN_SWON_2H       equ     0xfe
_WDTEN_ON_2H         equ     0xff
_WDTPS_1_2H          equ     0xc3
_WDTPS_2_2H          equ     0xc7
_WDTPS_4_2H          equ     0xcb
_WDTPS_8_2H          equ     0xcf
_WDTPS_16_2H         equ     0xd3
_WDTPS_32_2H         equ     0xd7
_WDTPS_64_2H         equ     0xdb
_WDTPS_128_2H        equ     0xdf
_WDTPS_256_2H        equ     0xe3
_WDTPS_512_2H        equ     0xe7
_WDTPS_1024_2H       equ     0xeb
_WDTPS_2048_2H       equ     0xef
_WDTPS_4096_2H       equ     0xf3
_WDTPS_8192_2H       equ     0xf7
_WDTPS_16384_2H      equ     0xfb
_WDTPS_32768_2H      equ     0xff
_CCP2MX_RB3_3H       equ     0xfe
_CCP2MX_RC1_3H       equ     0xff
_PBADEN_OFF_3H       equ     0xfd
_PBADEN_ON_3H        equ     0xff
_T3CMX_RB5_3H        equ     0xef
_T3CMX_RC0_3H        equ     0xff
_SDOMX_RC7_3H        equ     0xbf
_SDOMX_RB3_3H        equ     0xff
_MCLRE_OFF_3H        equ     0x7f
_MCLRE_ON_3H         equ     0xff
_STVREN_OFF_4L       equ     0xfe
_STVREN_ON_4L        equ     0xff
_LVP_OFF_4L          equ     0xfb
_LVP_ON_4L           equ     0xff
_ICPRT_OFF_4L        equ     0xdf
_ICPRT_ON_4L         equ     0xff
_XINST_OFF_4L        equ     0xbf
_XINST_ON_4L         equ     0xff
_DEBUG_ON_4L         equ     0x7f
_DEBUG_OFF_4L        equ     0xff
_CP0_ON_5L           equ     0xfe
_CP0_OFF_5L          equ     0xff
_CP1_ON_5L           equ     0xfd
_CP1_OFF_5L          equ     0xff
_CP2_ON_5L           equ     0xfb
_CP2_OFF_5L          equ     0xff
_CP3_ON_5L           equ     0xf7
_CP3_OFF_5L          equ     0xff
_CPB_ON_5H           equ     0xbf
_CPB_OFF_5H          equ     0xff
_CPD_ON_5H           equ     0x7f
_CPD_OFF_5H          equ     0xff
_WRT0_ON_6L          equ     0xfe
_WRT0_OFF_6L         equ     0xff
_WRT1_ON_6L          equ     0xfd
_WRT1_OFF_6L         equ     0xff
_WRT2_ON_6L          equ     0xfb
_WRT2_OFF_6L         equ     0xff
_WRT3_ON_6L          equ     0xf7
_WRT3_OFF_6L         equ     0xff
_WRTC_ON_6H          equ     0xdf
_WRTC_OFF_6H         equ     0xff
_WRTB_ON_6H          equ     0xbf
_WRTB_OFF_6H         equ     0xff
_WRTD_ON_6H          equ     0x7f
_WRTD_OFF_6H         equ     0xff
_EBTR0_ON_7L         equ     0xfe
_EBTR0_OFF_7L        equ     0xff
_EBTR1_ON_7L         equ     0xfd
_EBTR1_OFF_7L        equ     0xff
_EBTR2_ON_7L         equ     0xfb
_EBTR2_OFF_7L        equ     0xff
_EBTR3_ON_7L         equ     0xf7
_EBTR3_OFF_7L        equ     0xff
_EBTRB_ON_7H         equ     0xbf
_EBTRB_OFF_7H        equ     0xff
_DEVID1              equ 0x3ffffe
_DEVID2              equ 0x3fffff
_IDLOC0              equ 0x200000
_IDLOC1              equ 0x200001
_IDLOC2              equ 0x200002
_IDLOC3              equ 0x200003
_IDLOC4              equ 0x200004
_IDLOC5              equ 0x200005
_IDLOC6              equ 0x200006
_IDLOC7              equ 0x200007
